# -*- coding: utf-8 -*-

tasks = dict(
	power_of_year=dict(
		legend=(
			"2**2019 = ?"
		),
		answer=2**2019,
	),
	rome_cipher=dict(
		legend=(
			"Сегодня цезарь должен должен провести секретную встречу.\n"
			"Заговорщикам удалось получить секретное сообщение с точным местом куда отправится цезарь. Вот оно:\n"
			"OMBUFAX, RGXX YAAZ\n"
			"Хм ничего непонятно...\n"
			"Помогите восстановить республику и назовите место встречи цезаря и его пресмыкателей!\n"
		),
		answer="CAPITOL",
	),
	a_plus_b=dict(
		legend=(
			"Напишите функцию, которая принимает два числа в качестве аргументов\n"
			"и возвращает сумму этих чисел."
		),
		solution=lambda a, b: a + b,
		inputs=(
			(2, 2),
			(2, -2),
			(2018, 1),
			(11, 22),
			(643, -534),
			(754, 965),
			(64345, 8645646325),
			(4564, -4647),
			(-765097, 45656854),
			(57567, -7667756),
			(0, 0),
		),
	)
)
