# -*- coding: utf-8 -*-


def dominoes_solution(n, k, a):
	l = 0
	ans = 0
	for i in range(1, n):
		k -= a[i] - a[i - 1] - 1
		while k < 0:
			k += a[l + 1] - a[l] - 1
			l += 1
		ans = max(ans, a[i] - a[l] + 1 + k)
	while l < n - 1:
		k += a[l + 1] - a[l] - 1
		l += 1
		ans = max(ans, a[i] - a[l] + 1 + k)
	return ans


def dominoes_generator():
	return (
		(8, 4, [1, 2, 3, 4, 10, 11, 14, 15]),
	)


tasks = dict(
	power_of_year=dict(
		legend=(
			"2**2019 = ?"
		),
		answer=2**2019,
	),
	rome_cipher=dict(
		legend=(
			"Сегодня цезарь должен должен провести секретную встречу.\n"
			"Заговорщикам удалось получить секретное сообщение с точным местом куда отправится цезарь. Вот оно:\n"
			"OMBUFAX, RGXX YAAZ\n"
			"Хм ничего непонятно...\n"
			"Помогите восстановить республику и назовите место встречи цезаря и его пресмыкателей!\n"
		),
		answer="CAPITOL",
	),
	dominoes=dict(
		legend=(
			"Страну доминошек охватила паника. УЖЕ БОЛЕЕ 42 СЕКУНД НИКТО НЕ ВЫЗЫВАЛ МАКСИМАЛЬНЫЙ ЭФФЕКТ ДОМИНО.\n"
			"В ваших силах все исправить.\n"
			"Есть N доминошек.\n"
			"Все доминошки стоят на целочисленных позициях от 1 до 10^6.\n"
			"Максимальным эффектом домино называется такой единственный толчок доминошки,\n" 
			"что падает наибольшее количество доминошек(одна доминошка толкает другую только если они на соседних позициях)\n"
			"Ваша задача состоит в том, что бы вставив не более K дополнительных доминошек так, что бы длина\n"
			"МАКСИМАЛЬНОГО ЭФФЕКТА ДОМИНО была максимальна.\n"
		),
		solution=dominoes_solution,
		inputs=dominoes_generator(),
	),
	a_plus_b=dict(
		legend=(
			"Напишите функцию, которая принимает два числа в качестве аргументов\n"
			"и возвращает сумму этих чисел."
		),
		solution=lambda a, b: a + b,
		inputs=(
			(2, 2),
			(2, -2),
			(2018, 1),
			(11, 22),
			(643, -534),
			(754, 965),
			(64345, 8645646325),
			(4564, -4647),
			(-765097, 45656854),
			(57567, -7667756),
			(0, 0),
		),
	)
)
